# Pandas Cheat Sheet and Review #

## Series ##

Built on top of Numpy Array object but can have labels

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d = {'a':10,'b':20,"c":30}

In [6]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(arr,labels) #passing an Numpy Array

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(d) #passing in a dictionary, Pandas takes the keys and sets it as an index

a    10
b    20
c    30
dtype: int64

Series can hold almost any type of datatype, including built-in functions

***Indexing and basic operations***

In [17]:
ser1=pd.Series([1,2,3,4],['Austria','Poland','Canada','Switzerland']) #series with index
ser1

Austria        1
Poland         2
Canada         3
Switzerland    4
dtype: int64

In [19]:
ser2=pd.Series([1,2,5,4],['Austria','Poland','France','Switzerland'])
ser2

Austria        1
Poland         2
France         5
Switzerland    4
dtype: int64

In [22]:
ser1['Canada'], ser2['Poland']

(3, 2)

In [25]:
ser3=pd.Series(labels)
ser3

0    a
1    b
2    c
dtype: object

In [26]:
ser3[0]

'a'

In [27]:
ser1 + ser2

Austria        2.0
Canada         NaN
France         NaN
Poland         4.0
Switzerland    8.0
dtype: float64

## Pandas Data Frames 1 ##

In [41]:
from numpy.random import randn
np.random.seed(101)

In [42]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #pd.DataFrame(data,row_labels,column_labels)

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

***Columns***

In [46]:
df['W'] #Returns column of type list

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [57]:
df[['W','Z']] # returns multiple columns and dataframe type

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [58]:
#create a new column
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

***Delete column and Rows***  

`axis=0` is index of row, `axis=1` refers to columns. `inplace=True` means that changes occured inplace and not just visibility
`axis=0` is index of row, `axis=1` refers to columns. 

Reason for `axis=0` and `axis=1` is that rows start index at 0 and columns start index at 1 and this is taken from df.shape as in the numpy array case

In [63]:
#delete new column 
#axis=0 is index of row, axis=1 refers to columns. inplace=True means that changes occured inplace and not just visibility
df.drop('new',axis=1,inplace=True) #axis=0 is index of row, axis=1 refers to columns.

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [66]:
df.shape

(5, 4)

***Working with Rows***

In [67]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df.loc['A'] #via column name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [72]:
df.iloc[2] #via index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [78]:
#selecting and slicing
df.loc['B','Y']

-0.8480769834036315

In [79]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [81]:
df.iloc[:2,0:2]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

## Data Frames Part 2 ##

### Conditional Selection ###

In [99]:
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
booldf  = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [105]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [109]:
#boolean filtering
result = df[df['W']>0]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [112]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [114]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [125]:
#note above is equivalent to:
boolser=df['W']>0
result=df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

So it's obvious that a 1-liner is more concise and better uses less memory

#### Multiple Conditions ####

In [132]:
df[(df['W']>0) & (df['Y']>1)] #using AND will result in an ambigious error.

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [133]:
df[(df['W']>0) | (df['Y']>1)] #for or cannot use normal Python OR

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Indexing ###

In [134]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

***Resting the Index***

In [138]:
df.reset_index() #use inplace=True if you want it to modify original DataFrame

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [137]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [143]:
newind='BC AB SK MB ON'.split()
newind

['BC', 'AB', 'SK', 'MB', 'ON']

In [144]:
df['Provinces']=newind
df

          W         X         Y         Z Provinces
A  2.706850  0.628133  0.907969  0.503826        BC
B  0.651118 -0.319318 -0.848077  0.605965        AB
C -2.018168  0.740122  0.528813 -0.589001        SK
D  0.188695 -0.758872 -0.933237  0.955057        MB
E  0.190794  1.978757  2.605967  0.683509        ON

In [147]:
df.set_index('Provinces') #this will over-write the old index if you use inplace=True

                  W         X         Y         Z
Provinces
BC         2.706850  0.628133  0.907969  0.503826
AB         0.651118 -0.319318 -0.848077  0.605965
SK        -2.018168  0.740122  0.528813 -0.589001
MB         0.188695 -0.758872 -0.933237  0.955057
ON         0.190794  1.978757  2.605967  0.683509

## Data Frames Part 3 ##

### Multi-Index and Index Hierarchy ###

In [155]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside)) #returns: [('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [157]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [158]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [164]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [173]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [174]:
df.index.names=['Groups','Num']

In [175]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [180]:
#try grabbing 0.196800
df.loc['G2'].loc[2][1]

0.19679950499134005

In [182]:
#alternatively
df.loc['G2'].loc[2]['B']

0.19679950499134005

***Cross Section***  
Used with a multi-level index

In [183]:
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [185]:
#want all values where inside index is equal to 1 from each group. Use cross-section for this
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

## Dealing with Missing Data ##

In [187]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [190]:
df.dropna() #will drop rows that have NaN. For columns, use axis=1

     A    B  C
0  1.0  5.0  1

In [200]:
df.dropna(thresh=2) # thresh = Require that many non-NA values. So will keep where there is at least 2 non-NA values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [201]:
#fillna
df.fillna('missing value')

               A              B  C
0              1              5  1
1              2  missing value  2
2  missing value  missing value  3

In [203]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64